{
"humor": [
{
"id": 1,
"type": "humor",
"text": "The most dangerous game is trying to function normally with wet nails."
},
{
"id": 2,
"type": "humor",
"text": "My favorite exercise is running out of patience while my top coat dries."
},
{
"id": 3,
"type": "humor",
"text": "I'm one manicure away from having my life completely together."
},
{
"id": 4,
"type": "humor",
"text": "Choosing a nail polish color is the hardest decision I'll make all week."
},
{
"id": 5,
"type": "humor",
"text": "My nail polish collection is starting to look like a small paint store."
},
{
"id": 6,
"type": "humor",
"text": "I'm not saying I'm indecisive, but I've been staring at this polish wall for an hour."
},
{
"id": 7,
"type": "humor",
"text": "Life is too short to have boring nails."
},
{
"id": 8,
"type": "humor",
"text": "My brain has two modes: 'I need to save money' and 'Ooh, a new glitter polish!'"
},
{
"id": 9,
"type": "humor",
"text": "The three scariest words: 'Your card, please,' right after a manicure."
},
{
"id": 10,
"type": "humor",
"text": "I do my own nails, which is basically an extreme sport."
},
{
"id": 11,
"type": "humor",
"text": "Just spent an hour on my nails, so now I am unable to do anything else."
},
{
"id": 12,
"type": "humor",
"text": "May your coffee be strong and your top coat be stronger."
},
{
"id": 13,
"type": "humor",
"text": "Relationship status: In a long-term commitment with this nail color."
},
{
"id": 14,
"type": "humor",
"text": "So many nail polishes, so few fingers."
},
{
"id": 15,
"type": "humor",
"text": "I call this look 'I tried to do nail art and now there's glitter on the cat'."
},
{
"id": 16,
"type": "humor",
"text": "The best part of a manicure is pretending you're a hand model for the next hour."
},
{
"id": 17,
"type": "humor",
"text": "My superpower is being able to smudge a manicure that's been dry for hours."
},
{
"id": 18,
"type": "humor",
"text": "I'm sorry for what I said when I was waiting for my nails to dry."
},
{
"id": 19,
"type": "humor",
"text": "You know you're an adult when you get excited about a new top coat."
},
{
"id": 20,
"type": "humor",
"text": "My non-dominant hand's nail art always looks like a modern art masterpiece."
},
{
"id": 21,
"type": "humor",
"text": "Forget the glass slipper, this princess wants a new set of nails."
},
{
"id": 22,
"type": "humor",
"text": "I have it all together, I just forgot where I put it... probably near my polish collection."
},
{
"id": 23,
"type": "humor",
"text": "I trust my manicurist more than I trust most of my own decisions."
},
{
"id": 24,
"type": "humor",
"text": "Nails without a little sparkle is like a cake without frosting."
},
{
"id": 25,
"type": "humor",
"text": "Patience is touching your nails together to see if they're dry yet."
},
{
"id": 26,
"type": "humor",
"text": "I want my nails to be this color, but also this color, and maybe this one too."
},
{
"id": 27,
"type": "humor",
"text": "What do you mean I have too much nail polish? That's not a thing."
},
{
"id": 28,
"type": "humor",
"text": "The only thing I'm committed to right now is this shade of red."
},
{
"id": 29,
"type": "humor",
"text": "My nails are not a snack, I repeat, my nails are not a snack."
},
{
"id": 30,
"type": "humor",
"text": "I have a degree in 'which of these 5 identical pinks should I wear?'."
},
{
"id": 31,
"type": "humor",
"text": "My favorite season is when the new nail polish collections drop."
},
{
"id": 32,
"type": "humor",
"text": "Keep calm and paint your nails."
},
{
"id": 33,
"type": "humor",
"text": "A manicure is just a therapy session with a prettier result."
},
{
"id": 34,
"type": "humor",
"text": "I wish my bank account refilled as fast as I find new polishes to buy."
},
{
"id": 35,
"type": "humor",
"text": "The moment of sheer terror when you have an itch and your nails are wet."
},
{
"id": 36,
"type": "humor",
"text": "You can't buy happiness, but you can buy nail polish, which is kind of the same thing."
},
{
"id": 37,
"type": "humor",
"text": "I'm not perfect, but my nails are, and that's what really matters."
},
{
"id": 38,
"type": "humor",
"text": "I use my freshly manicured nails to point at things I can't pick up."
},
{
"id": 39,
"type": "humor",
"text": "The first chip in a new manicure feels like a tiny tragedy."
},
{
"id": 40,
"type": "humor",
"text": "My nail tech knows more about my life than my own journal."
},
{
"id": 41,
"type": "humor",
"text": "There's no problem so big that a new manicure can't make it a little better."
},
{
"id": 42,
"type": "humor",
"text": "I'm pretty sure my blood type is glitter."
},
{
"id": 43,
"type": "humor",
"text": "My hobbies include buying nail polish and then using the same three colors over and over."
},
{
"id": 44,
"type": "humor",
"text": "Waving goodbye to my money as I enter the nail salon."
},
{
"id": 45,
"type": "humor",
"text": "The 'is it dry?' nail tap is the riskiest game you can play."
},
{
"id": 46,
"type": "humor",
"text": "I consider 'removing glitter polish' an Olympic sport."
},
{
"id": 47,
"type": "humor",
"text": "That awkward moment when your nails are longer than your patience."
},
{
"id": 48,
"type": "humor",
"text": "My nail art is my favorite way to be loud without saying a word."
},
{
"id": 49,
"type": "humor",
"text": "Behind every successful person is a substantial amount of nail polish."
},
{
"id": 50,
"type": "humor",
"text": "Don't judge a person by their messy hair, judge them by their flawless manicure."
},
{
"id": 51,
"type": "humor",
"text": "I'm not addicted to nail polish, we're just in a very committed relationship."
},
{
"id": 52,
"type": "humor",
"text": "Feeling stressed? There's a nail polish for that."
},
{
"id": 53,
"type": "humor",
"text": "The only drama I enjoy is in my nail art."
},
{
"id": 54,
"type": "humor",
"text": "My nail polish costs more than my lunch, and I see nothing wrong with that."
},
{
"id": 55,
"type": "humor",
"text": "The floor of my room is now permanently glitter-coated, and I've accepted it."
},
{
"id": 56,
"type": "humor",
"text": "I speak fluent nail polish: 'I'm Not Really a Waitress' and 'Lincoln Park After Dark'."
},
{
"id": 57,
"type": "humor",
"text": "You think I'm listening, but I'm really just admiring my nails."
},
{
"id": 58,
"type": "humor",
"text": "Opening a can of soda is the ultimate test of a fresh manicure's strength."
},
{
"id": 59,
"type": "humor",
"text": "My weekly schedule revolves around my manicure appointment."
},
{
"id": 60,
"type": "humor",
"text": "I'm not lazy, I'm just in 'don't-mess-up-my-nails' mode."
},
{
"id": 61,
"type": "humor",
"text": "My favorite part of the day is when my nails are finally, truly, 100% dry."
},
{
"id": 62,
"type": "humor",
"text": "I have 99 problems but my nails ain't one."
},
{
"id": 63,
"type": "humor",
"text": "I like my nails how I like my jokes: a little bit twisted."
},
{
"id": 64,
"type": "humor",
"text": "Some people meditate, I just paint my nails."
},
{
"id": 5,
"type": "humor",
"text": "My nail polish collection is my most valuable and least practical asset."
},
{
"id": 66,
"type": "humor",
"text": "If you see me with a chipped nail, please know that I'm not okay."
},
{
"id": 67,
"type": "humor",
"text": "Trying to type with long nails is a skill that should go on my resume."
},
{
"id": 68,
"type": "humor",
"text": "I'm emotionally attached to a tiny bottle of colored lacquer."
},
{
"id": 69,
"type": "humor",
"text": "My nails are my canvas, and I'm a very indecisive artist."
},
{
"id": 70,
"type": "humor",
"text": "A day without nail polish is like... just kidding, I have no idea."
},
{
"id": 71,
"type": "humor",
"text": "My 'rainy day fund' is just for emergency manicures."
},
{
"id": 72,
"type": "humor",
"text": "The greatest love story ever told is me and my top coat."
},
{
"id": 73,
"type": "humor",
"text": "I'm powered by coffee and cuticle oil."
},
{
"id": 74,
"type": "humor",
"text": "If I had a dollar for every bottle of polish I own, I could afford another bottle."
},
{
"id": 75,
"type": "humor",
"text": "Life is a journey, and I'm just trying to not chip my nails along the way."
},
{
"id": 76,
"type": "humor",
"text": "The quiet confidence that comes from having perfectly polished nails is underrated."
},
{
"id": 77,
"type": "humor",
"text": "My nails are in their 'growing out the mistake' phase."
},
{
"id": 78,
"type": "humor",
"text": "I've started measuring time in manicures."
},
{
"id": 79,
"type": "humor",
"text": "Pro tip: If you can't decide on a color, just use all of them."
},
{
"id": 80,
"type": "humor",
"text": "I'm not clumsy, my nails are just so fabulous they need their own personal space."
},
{
"id": 81,
"type": "humor",
"text": "I don't need a mood ring, I have nail polish."
},
{
"id": 82,
"type": "humor",
"text": "My nail tech is the only person I let get that close with a sharp object."
},
{
"id": 83,
"type": "humor",
"text": "I might have trust issues, but at least my nail polish has a good base."
},
{
"id": 84,
"type": "humor",
"text": "Organization is putting all your nail polishes in color order."
},
{
"id": 85,
"type": "humor",
"text": "Some people wear their heart on their sleeve, I wear my art on my nails."
},
{
"id": 86,
"type": "humor",
"text": "My natural nail color is 'whatever I couldn't get off from the last manicure'."
},
{
"id": 87,
"type": "humor",
"text": "My hands look so much more elegant when I'm not using them to open a jar."
},
{
"id": 88,
"type": "humor",
"text": "I'd stop buying nail polish, but I'm no quitter."
},
{
"id": 89,
"type": "humor",
"text": "The only thing getting lit this weekend are my UV gel lamps."
},
{
"id": 90,
"type": "humor",
"text": "My favorite fantasy is a nail polish that dries instantly and never chips."
},
{
"id": 91,
"type": "humor",
"text": "I believe in manicures on Mondays to start the week off right."
},
{
"id": 92,
"type": "humor",
"text": "My nail art is a cry for help... a very fabulous cry for help."
},
{
"id": 93,
"type": "humor",
"text": "I have a black belt in applying nail polish in a moving car."
},
{
"id": 94,
"type": "humor",
"text": "Today's good mood is sponsored by my new manicure."
},
{
"id": 95,
"type": "humor",
"text": "My will to function is directly proportional to how good my nails look."
},
{
"id": 96,
"type": "humor",
"text": "I'm just a girl, standing in front of a polish rack, asking it to love her."
},
{
"id": 97,
"type": "humor",
"text": "I've learned more about patience from doing my nails than from anything else in life."
},
{
"id": 98,
"type": "humor",
"text": "The difference between a good day and a bad day is a fresh coat of polish."
},
{
"id": 99,
"type": "humor",
"text": "My nails are my tiny, colorful bodyguards against a dull day."
},
{
"id": 100,
"type": "humor",
"text": "I whisper 'don't you dare chip' to my nails at least ten times a day."
}
]
}